/*
В функцию arraySorting() приходит строка чисел с разделительными запятыми вида "1,2,33,0,17".
Преобразуйте строку в массив чисел, отсортируйте их по возрастанию и верните строку с упорядоченными числами,
разделенными запятыми.
*/
export function arraySorting(data) {
    const array = data.split(',').map(Number);
    array.sort((a, b) => a - b);
    return array.join(',');
}

/*
В функцию arrayFiltering() приходит массив целых чисел.
Преобразуйте массив таким образом, чтобы все элементы массива, в которых содержатся числа более 100,
были удалены из массива, и верните его в качестве результата функции.
*/
export function arrayFiltering(data) {
    return data.filter((num) => num <= 100);
}

/*
В функцию arrayPushing() приходят два массива целых чисел размерностью 5 элементов.
Получите третий массив размерностью 10 элементов, в котором последовательно чередуются
значения из первых двух массивов, и верните его в качестве результата функции.
*/
export function arrayPushing(array1, array2) {
    const result = [];

    for (let i = 0; i < 5; i++) {
        result.push(array1[i]);
        result.push(array2[i]);
    }

    return result;
}